bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F750.svd
            <register>
               <name>ALRMBSSR</name>
               <displayName>ALRMBSSR</displayName>
               <description>alarm B sub second register</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MASKSS</name>
                     <description>Mask the most-significant bits starting               at this bit</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SS</name>
                     <description>Sub seconds value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OR</name>
               <displayName>OR</displayName>
               <description>option register</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RTC_ALARM_TYPE</name>
                     <description>RTC_ALARM on PC13 output               type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTC_OUT_RMP</name>
                     <description>RTC_OUT remap</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP0R</name>
               <displayName>BKP0R</displayName>
               <description>backup register</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP1R</name>
               <displayName>BKP1R</displayName>
               <description>backup register</description>
               <addressOffset>0x54</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP2R</name>
               <displayName>BKP2R</displayName>
               <description>backup register</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP3R</name>
               <displayName>BKP3R</displayName>
               <description>backup register</description>
               <addressOffset>0x5C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP4R</name>
               <displayName>BKP4R</displayName>
               <description>backup register</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP5R</name>
               <displayName>BKP5R</displayName>
               <description>backup register</description>
               <addressOffset>0x64</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP6R</name>
               <displayName>BKP6R</displayName>
               <description>backup register</description>
               <addressOffset>0x68</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP7R</name>
               <displayName>BKP7R</displayName>
               <description>backup register</description>
               <addressOffset>0x6C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP8R</name>
               <displayName>BKP8R</displayName>
               <description>backup register</description>
               <addressOffset>0x70</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP9R</name>
               <displayName>BKP9R</displayName>
               <description>backup register</description>
               <addressOffset>0x74</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP10R</name>
               <displayName>BKP10R</displayName>
               <description>backup register</description>
               <addressOffset>0x78</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP11R</name>
               <displayName>BKP11R</displayName>
               <description>backup register</description>
               <addressOffset>0x7C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP12R</name>
               <displayName>BKP12R</displayName>
               <description>backup register</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP13R</name>
               <displayName>BKP13R</displayName>
               <description>backup register</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP14R</name>
               <displayName>BKP14R</displayName>
               <description>backup register</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP15R</name>
               <displayName>BKP15R</displayName>
               <description>backup register</description>
               <addressOffset>0x8C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP16R</name>
               <displayName>BKP16R</displayName>
               <description>backup register</description>
               <addressOffset>0x90</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP17R</name>
               <displayName>BKP17R</displayName>
               <description>backup register</description>
               <addressOffset>0x94</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP18R</name>
               <displayName>BKP18R</displayName>
               <description>backup register</description>
               <addressOffset>0x98</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP19R</name>
               <displayName>BKP19R</displayName>
               <description>backup register</description>
               <addressOffset>0x9C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP20R</name>
               <displayName>BKP20R</displayName>
               <description>backup register</description>
               <addressOffset>0xA0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP21R</name>
               <displayName>BKP21R</displayName>
               <description>backup register</description>
               <addressOffset>0xA4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP22R</name>
               <displayName>BKP22R</displayName>
               <description>backup register</description>
               <addressOffset>0xA8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP23R</name>
               <displayName>BKP23R</displayName>
               <description>backup register</description>
               <addressOffset>0xAC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP24R</name>
               <displayName>BKP24R</displayName>
               <description>backup register</description>
               <addressOffset>0xB0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP25R</name>
               <displayName>BKP25R</displayName>
               <description>backup register</description>
               <addressOffset>0xB4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP26R</name>
               <displayName>BKP26R</displayName>
               <description>backup register</description>
               <addressOffset>0xB8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP27R</name>
               <displayName>BKP27R</displayName>
               <description>backup register</description>
               <addressOffset>0xBC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP28R</name>
               <displayName>BKP28R</displayName>
               <description>backup register</description>
               <addressOffset>0xC0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP29R</name>
               <displayName>BKP29R</displayName>
               <description>backup register</description>
               <addressOffset>0xC4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP30R</name>
               <displayName>BKP30R</displayName>
               <description>backup register</description>
               <addressOffset>0xC8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP31R</name>
               <displayName>BKP31R</displayName>
               <description>backup register</description>
               <addressOffset>0xCC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
