bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F750.svd
            <register>
               <name>OTG_FS_HNPTXSTS</name>
               <displayName>OTG_FS_HNPTXSTS</displayName>
               <description>OTG_FS non-periodic transmit FIFO/queue           status register (OTG_FS_GNPTXSTS)</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00080200</resetValue>
               <fields>
                  <field>
                     <name>NPTXFSAV</name>
                     <description>Non-periodic TxFIFO space               available</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>NPTQXSAV</name>
                     <description>Non-periodic transmit request queue               space available</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NPTXQTOP</name>
                     <description>Top of the non-periodic transmit request               queue</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_GCCFG</name>
               <displayName>OTG_FS_GCCFG</displayName>
               <description>OTG_FS general core configuration register           (OTG_FS_GCCFG)</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWRDWN</name>
                     <description>Power down</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BCDEN</name>
                     <description>Battery charging detector (BCD)               enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCDEN</name>
                     <description>Data contact detection (DCD) mode               enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDEN</name>
                     <description>Primary detection (PD) mode               enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDEN</name>
                     <description>Secondary detection (SD) mode               enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBDEN</name>
                     <description>USB VBUS detection enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCDET</name>
                     <description>Data contact detection (DCD)               status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDET</name>
                     <description>Primary detection (PD)               status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDET</name>
                     <description>Secondary detection (SD)               status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PS2DET</name>
                     <description>DM pull-up detection               status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_CID</name>
               <displayName>OTG_FS_CID</displayName>
               <description>core ID register</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00001000</resetValue>
               <fields>
                  <field>
                     <name>PRODUCT_ID</name>
                     <description>Product ID field</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_HPTXFSIZ</name>
               <displayName>OTG_FS_HPTXFSIZ</displayName>
               <description>OTG_FS Host periodic transmit FIFO size           register (OTG_FS_HPTXFSIZ)</description>
               <addressOffset>0x100</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x02000600</resetValue>
               <fields>
                  <field>
                     <name>PTXSA</name>
                     <description>Host periodic TxFIFO start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>PTXFSIZ</name>
                     <description>Host periodic TxFIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_DIEPTXF1</name>
               <displayName>OTG_FS_DIEPTXF1</displayName>
               <description>OTG_FS device IN endpoint transmit FIFO size           register (OTG_FS_DIEPTXF1)</description>
               <addressOffset>0x104</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>INEPTXSA</name>
                     <description>IN endpoint FIFO2 transmit RAM start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INEPTXFD</name>
                     <description>IN endpoint TxFIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_DIEPTXF2</name>
               <displayName>OTG_FS_DIEPTXF2</displayName>
               <description>OTG_FS device IN endpoint transmit FIFO size           register (OTG_FS_DIEPTXF2)</description>
               <addressOffset>0x108</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>INEPTXSA</name>
                     <description>IN endpoint FIFO3 transmit RAM start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INEPTXFD</name>
                     <description>IN endpoint TxFIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_DIEPTXF3</name>
               <displayName>OTG_FS_DIEPTXF3</displayName>
               <description>OTG_FS device IN endpoint transmit FIFO size           register (OTG_FS_DIEPTXF3)</description>
               <addressOffset>0x10C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>INEPTXSA</name>
                     <description>IN endpoint FIFO4 transmit RAM start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INEPTXFD</name>
                     <description>IN endpoint TxFIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_GRXSTSP_Device</name>
               <displayName>OTG_FS_GRXSTSP_Device</displayName>
               <description>OTG status read and pop register (Device           mode)</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>EPNUM</name>
                     <description>Endpoint number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BCNT</name>
                     <description>Byte count</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>DPID</name>
                     <description>Data PID</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PKTSTS</name>
                     <description>Packet status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FRMNUM</name>
                     <description>Frame number</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_GRXSTSP_Host</name>
               <displayName>OTG_FS_GRXSTSP_Host</displayName>
               <description>OTG status read and pop register (Host           mode)</description>
               <alternateRegister>OTG_FS_GRXSTSP_Device</alternateRegister>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>CHNUM</name>
                     <description>Channel number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BCNT</name>
                     <description>Byte count</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>DPID</name>
                     <description>Data PID</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PKTSTS</name>
                     <description>Packet status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_GI2CCTL</name>
               <displayName>OTG_FS_GI2CCTL</displayName>
               <description>OTG I2C access register</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>RWDATA</name>
                     <description>I2C Read/Write Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>REGADDR</name>
                     <description>I2C Register Address</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ADDR</name>
                     <description>I2C Address</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>I2CEN</name>
                     <description>I2C Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACK</name>
                     <description>I2C ACK</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2CDEVADR</name>
                     <description>I2C Device Address</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>I2CDATSE0</name>
                     <description>I2C DatSe0 USB mode</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RW</name>
                     <description>Read/Write Indicator</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BSYDNE</name>
                     <description>I2C Busy/Done</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_GPWRDN</name>
               <displayName>OTG_FS_GPWRDN</displayName>
               <description>OTG power down register</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>ADPMEN</name>
                     <description>ADP module enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADPIF</name>
                     <description>ADP interrupt flag</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_GADPCTL</name>
               <displayName>OTG_FS_GADPCTL</displayName>
               <description>OTG ADP timer, control and status           register</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>PRBDSCHG</name>
                     <description>Probe discharge</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PRBDELTA</name>
                     <description>Probe delta</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PRBPER</name>
                     <description>Probe period</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTIM</name>
                     <description>Ramp time</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>11</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ENAPRB</name>
                     <description>Enable probe</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ENASNS</name>
                     <description>Enable sense</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ADPRST</name>
                     <description>ADP reset</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ADPEN</name>
                     <description>ADP enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ADPPRBIF</name>
                     <description>ADP probe interrupt flag</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ADPSNSIF</name>
                     <description>ADP sense interrupt flag</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ADPTOIF</name>
                     <description>ADP timeout interrupt flag</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ADPPRBIM</name>
                     <description>ADP probe interrupt mask</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ADPSNSIM</name>
                     <description>ADP sense interrupt mask</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ADPTOIM</name>
                     <description>ADP timeout interrupt mask</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>AR</name>
                     <description>Access request</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_DIEPTXF4</name>
               <displayName>OTG_FS_DIEPTXF4</displayName>
               <description>OTG_FS device IN endpoint transmit FIFO size           register (OTG_FS_DIEPTXF4)</description>
               <addressOffset>0x110</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>INEPTXSA</name>
                     <description>IN endpoint FIFOx transmit RAM start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INEPTXFD</name>
                     <description>IN endpoint Tx FIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_DIEPTXF5</name>
               <displayName>OTG_FS_DIEPTXF5</displayName>
               <description>OTG_FS device IN endpoint transmit FIFO size           register (OTG_FS_DIEPTXF5)</description>
               <addressOffset>0x114</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>INEPTXSA</name>
                     <description>IN endpoint FIFOx transmit RAM start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INEPTXFD</name>
                     <description>IN endpoint Tx FIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
