bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F750.svd
            <register>
               <name>OTG_HS_DIEPINT2</name>
               <displayName>OTG_HS_DIEPINT2</displayName>
               <description>OTG device endpoint-2 interrupt           register</description>
               <addressOffset>0x148</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRC</name>
                     <description>Transfer completed               interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>Endpoint disabled               interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TOC</name>
                     <description>Timeout condition</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ITTXFE</name>
                     <description>IN token received when TxFIFO is               empty</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INEPNE</name>
                     <description>IN endpoint NAK effective</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TXFE</name>
                     <description>Transmit FIFO empty</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TXFIFOUDRN</name>
                     <description>Transmit Fifo Underrun</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BNA</name>
                     <description>Buffer not available               interrupt</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PKTDRPSTS</name>
                     <description>Packet dropped status</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BERR</name>
                     <description>Babble error interrupt</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>NAK</name>
                     <description>NAK interrupt</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPINT3</name>
               <displayName>OTG_HS_DIEPINT3</displayName>
               <description>OTG device endpoint-3 interrupt           register</description>
               <addressOffset>0x168</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRC</name>
                     <description>Transfer completed               interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>Endpoint disabled               interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TOC</name>
                     <description>Timeout condition</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ITTXFE</name>
                     <description>IN token received when TxFIFO is               empty</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INEPNE</name>
                     <description>IN endpoint NAK effective</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TXFE</name>
                     <description>Transmit FIFO empty</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TXFIFOUDRN</name>
                     <description>Transmit Fifo Underrun</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BNA</name>
                     <description>Buffer not available               interrupt</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PKTDRPSTS</name>
                     <description>Packet dropped status</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BERR</name>
                     <description>Babble error interrupt</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>NAK</name>
                     <description>NAK interrupt</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPINT4</name>
               <displayName>OTG_HS_DIEPINT4</displayName>
               <description>OTG device endpoint-4 interrupt           register</description>
               <addressOffset>0x188</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRC</name>
                     <description>Transfer completed               interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>Endpoint disabled               interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TOC</name>
                     <description>Timeout condition</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ITTXFE</name>
                     <description>IN token received when TxFIFO is               empty</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INEPNE</name>
                     <description>IN endpoint NAK effective</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TXFE</name>
                     <description>Transmit FIFO empty</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TXFIFOUDRN</name>
                     <description>Transmit Fifo Underrun</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BNA</name>
                     <description>Buffer not available               interrupt</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PKTDRPSTS</name>
                     <description>Packet dropped status</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BERR</name>
                     <description>Babble error interrupt</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>NAK</name>
                     <description>NAK interrupt</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPINT5</name>
               <displayName>OTG_HS_DIEPINT5</displayName>
               <description>OTG device endpoint-5 interrupt           register</description>
               <addressOffset>0x1A8</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRC</name>
                     <description>Transfer completed               interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>Endpoint disabled               interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TOC</name>
                     <description>Timeout condition</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ITTXFE</name>
                     <description>IN token received when TxFIFO is               empty</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INEPNE</name>
                     <description>IN endpoint NAK effective</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TXFE</name>
                     <description>Transmit FIFO empty</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TXFIFOUDRN</name>
                     <description>Transmit Fifo Underrun</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BNA</name>
                     <description>Buffer not available               interrupt</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PKTDRPSTS</name>
                     <description>Packet dropped status</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BERR</name>
                     <description>Babble error interrupt</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>NAK</name>
                     <description>NAK interrupt</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPINT6</name>
               <displayName>OTG_HS_DIEPINT6</displayName>
               <description>OTG device endpoint-6 interrupt           register</description>
               <addressOffset>0x1C8</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRC</name>
                     <description>Transfer completed               interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>Endpoint disabled               interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TOC</name>
                     <description>Timeout condition</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ITTXFE</name>
                     <description>IN token received when TxFIFO is               empty</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INEPNE</name>
                     <description>IN endpoint NAK effective</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TXFE</name>
                     <description>Transmit FIFO empty</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TXFIFOUDRN</name>
                     <description>Transmit Fifo Underrun</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BNA</name>
                     <description>Buffer not available               interrupt</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PKTDRPSTS</name>
                     <description>Packet dropped status</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BERR</name>
                     <description>Babble error interrupt</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>NAK</name>
                     <description>NAK interrupt</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPINT7</name>
               <displayName>OTG_HS_DIEPINT7</displayName>
               <description>OTG device endpoint-7 interrupt           register</description>
               <addressOffset>0x1E8</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRC</name>
                     <description>Transfer completed               interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>Endpoint disabled               interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TOC</name>
                     <description>Timeout condition</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ITTXFE</name>
                     <description>IN token received when TxFIFO is               empty</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INEPNE</name>
                     <description>IN endpoint NAK effective</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TXFE</name>
                     <description>Transmit FIFO empty</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TXFIFOUDRN</name>
                     <description>Transmit Fifo Underrun</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BNA</name>
                     <description>Buffer not available               interrupt</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PKTDRPSTS</name>
                     <description>Packet dropped status</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BERR</name>
                     <description>Babble error interrupt</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>NAK</name>
                     <description>NAK interrupt</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPTSIZ0</name>
               <displayName>OTG_HS_DIEPTSIZ0</displayName>
               <description>OTG_HS device IN endpoint 0 transfer size           register</description>
               <addressOffset>0x110</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
